Repository: ssm2017/ostmu
Catalog: locale/*/LC_MESSAGES/ostmu.po
Languages: fr

source: This script must be run as root.
fr: Ce script doit être exécuté en tant que root.

source: The opensimulator bin folder does not exist.
fr: Le dossier bin de opensimulator n'existe pas.

source: The opensimulator bin folder exists.
fr: Le dossier bin de opensimulator existe

source: The folder ${TMUX_SOCKET_FOLDER} was created.
fr: Le dossier ${TMUX_SOCKET_FOLDER} a été créé.

source: The folder ${TMUX_SOCKET_FOLDER} exists.
fr: Le dossier ${TMUX_SOCKET_FOLDER} existe.

source: Group ownership changed for folder ${TMUX_SOCKET_FOLDER}.
fr: La propriété du groupe pour le dossier ${TMUX_SOCKET_FOLDER} a été changée.

source: The folder ${TMUX_SOCKET_FOLDER} has good group ownership.
fr: Le dossier ${TMUX_SOCKET_FOLDER} appartient au bon groupe.

source: The permissions were set to 2770 for the folder ${TMUX_SOCKET_FOLDER}.
fr: Les permissions pour le dossier ${TMUX_SOCKET_FOLDER} ont été définies sur 2770.

source: The permissions of the folder ${TMUX_SOCKET_FOLDER} are 2770.
fr: Les permissions sur le dossier ${TMUX_SOCKET_FOLDER} sont 2770.

source: Usage : create_sim <user_name> <sim_name>
fr: Utilisation : create_sim <user_name> <sim_name>

source: 10 sims maximum per user.
fr: 10 sims maximum par utilisateur.

source: The user ${user_name} exists.
fr: L'utilisateur ${user_name} existe.

source: The user ${user_name} does not exist.
fr: L'utilisateur ${user_name} n'existe pas.

source: The folder /var/lib/ostmu was created.
fr: Le dossier /var/lib/ostmu a été créé.

source: The folder /var/lib/ostmu exists.
fr: Le dossier /var/lib/ostmu existe.

source: The file ${OSTMU_PORTS_FILE} was created.
fr: Le fichier ${OSTMU_PORTS_FILE} a été créé.

source: The file ${OSTMU_PORTS_FILE} exists.
fr: Le fichier ${OSTMU_PORTS_FILE} existe.

source: The ports file is not writable
fr: Le fichier des ports n'est pas accessible en écriture.

source: The folder ${user_config_folder_path} was created.
fr: Le dossier ${user_config_folder_path} a été créé.

source: The ownership of the folder ${user_config_folder_path} was set to ${user_name}
fr: La propriété du dossier ${user_config_folder_path} a été définie sur ${user_name}

source: The folder ${user_config_folder_path} exists.
fr: Le dossier ${user_config_folder_path} existe.

source: The file ${user_config_folder_path}/db_pass was created.
fr: Le fichier ${user_config_folder_path}/db_pass a été créé.

source: The ownership of the file ${user_config_folder_path}/db_pass was set to ${user_name}
fr: La propriété du fichier ${user_config_folder_path}/db_pass a été définie sur ${user_name}

source: The user ${user_name} was created in the database.
fr: L'utilisateur ${user_name} a été créé dans la base de données.

source: The user ${user_name} exists in the database.
fr: L'utilisateur ${user_name} existe dans la base de données.

source: The folder ${sim_folder} was created.
fr: Le dossier ${sim_folder} a été créé.

source: The folder ${sim_folder} exists.
fr: Le dossier ${sim_folder} existe.

source: Usage : check_sim <user_name> <sim_name>
fr: Utilisation : check_sim <user_name> <sim_name>

source: The folder ${sim_folder} does not exist.
fr: Le dossier ${sim_folder} n'existe pas.

source: PID is running.
fr: Le PID s'exécute.

source: PID is not running.
fr: Le PID ne s'exécute pas.

source: The file PID does not exist.
fr: Le fichier PID n'existe pas.

source: The tmux session is running.
fr: La session tmux s'exécute.

source: The tmux session is not running.
fr: La session tmux ne s'exécute pas.

source: The tmux window is running.
fr: La fenêtre tmux s'exécute.

source: The tmux window is not running.
fr: La fenêtre tmux ne s'exécute pas.

source: The simulator console is answering.
fr: La console du simulateur répond.

source: The simulator console is not answering.
fr: La console du simulateur ne répond pas.

source: The folder ${user_config_folder_path} does not exist.
fr: Le dossier ${user_config_folder_path} n'existe pas.

source: The folder ${fullname} exists.
fr: Le dossier ${fullname} existe.

source: There are no .sim folders inside ${user_config_folder_path}.
fr: Le dossier ${user_config_folder_path} existe.

source: Your user session : ${session_name} is running.
fr: Votre session utilisateur : ${session_name} s'exécute.

source: Your user session is not running.
fr: Votre session utilisateur ne s'exécute pas.

source: Do you want to create your user session ?
fr: Voulez vous créer votre session utilisateur ?

source: Enter y or n :
fr: Entrez y ou n:

source: Creating your user session.
fr: Creation de votre session utilisateur.

source: The tmux window ${simname} exists.
fr: La fenêtre tmux ${simname} existe.

source: The tmux window ${simname} does not exist.
fr: La fenêtre tmux ${simname} n'existe pas.

source: ${#has_window[@]} running simulators.
fr: ${#has_window[@]} simulateurs en marche.

source: ${#has_no_has_window[@]} non running simulators.
fr: ${#has_no_has_window[@]} simulateurs arrétés.

source: Do you want to start a new simulator ?
fr: Voulez vous démarrer un nouveau simulateur ?

source: available simulators :
fr: simulateurs disponibles:

source: What simulator do you want to start ?
fr: Quel simulateur voulez vous démarrer ?

source: Enter a number :
fr: Entrez un nombre:

source: Wrong answer. Good bye.
fr: Mauvaise réponse. Au revoir.

source: Creating the window : ${simname}
fr: Création de la fenêtre: ${simname}

source: Starting the simulator
fr: Démarrage du simulateur

source: Do you want to see the session ?
fr: Voulez vous voir la session ?

source: Usage : update_password <user_name>
fr: Utilisation : update_password <user_name>

source: The user password file exists.
fr: Le fichier de mot de passe de l'utilisateur existe.

source: The user password file does not exist.
fr: Le fichier de mot de passe de l'utilisateur n'existe pas.
